In [1]:
import pandas as pd
import numpy as np

In [2]:
students_preformance=pd.read_csv("StudentsPerformance.csv")

In [4]:
students_preformance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
students_preformance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
students_preformance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [7]:
students_preformance.shape

(1000, 8)

In [10]:
students_preformance.groupby('gender').aggregate({'math score': 'mean'})

        math score
gender
female   63.633205
male     68.728216

In [11]:
students_preformance.size

8000

In [12]:
students_preformance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [13]:
students_preformance.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [15]:
students_preformance.iloc[[0,3,7], [-1,3,5]]

   writing score         lunch  math score
0             74      standard          72
3             44  free/reduced          47
7             39  free/reduced          40

In [16]:
students_preformance_with_names=students_preformance.iloc[[0,3,4,7,8]]

In [17]:
students_preformance_with_names.index=["Cersei", "Tywin", "George", "Joffrey", "Ilyn Payne"]

In [18]:
students_preformance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
George,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [23]:
students_preformance_with_names.loc[["Cersei", "Tywin"], ["gender", "writing score"]]

        gender  writing score
Cersei  female             74
Tywin     male             44

In [27]:
students_preformance_with_names.iloc[:,0]

Cersei        female
Tywin           male
George          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [28]:
type(students_preformance_with_names.iloc[:,0])

pandas.core.series.Series

In [30]:
pd.Series([1,3,4], index=["Cersei", "Tywin", "George"])

Cersei    1
Tywin     3
George    4
dtype: int64

In [31]:
my_series_1 = pd.Series([1,3,4], index=["Cersei", "Tywin", "George"])
my_series_2 = pd.Series([5,11,12], index=["Cersei", "Tywin", "George"])

In [33]:
pd.DataFrame({'col_name_1': my_series_1, 'col_name_2': my_series_2})

        col_name_1  col_name_2
Cersei           1           5
Tywin            3          11
George           4          12

In [36]:
students_preformance.loc[students_preformance.gender == 'female']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [44]:
mean_wrtiting_score = students_preformance['writing score'].mean()

In [46]:
mean_wrtiting_score

68.054

In [45]:
students_preformance.loc[mean_wrtiting_score < students_preformance['writing score']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [54]:
students_preformance = students_preformance.rename( columns = {'parental level of education': 'parental_level_of_education',
                                                    'test preparation course': 'test_preparation_course',
                                                    'math score': 'math_score', 'reading score': 'reading_score',
                                                    'writing score': 'writing_score'})

In [55]:
students_preformance

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [57]:
students_preformance.query("writing_score > 74 | math_score <60")

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [61]:
students_preformance_with_names.filter(like="se", axis=0)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74